import React from 'react';

const ArithmeticOne = () => {
    return (
        <div className={"container"}>
                <p className="desc">
                        Целочисленная арифметика - это раздел математики и программирования, который занимается операциями с целыми числами без десятичной части (дробей). В целочисленной арифметике не учитываются десятичные разделители или знаки после запятой.
                        <br/>
                        В целочисленной арифметике доступны следующие операции:
                        <br/>
                        1) Сложение: операция, выполняющая сложение двух целых чисел. Например, 2 + 3 = 5.
                        <br/>
                        2) Вычитание: операция, выполняющая вычитание одного целого числа из другого. Например, 5 - 3 = 2.
                        <br/>
                        3) Умножение: операция, выполняющая умножение двух целых чисел. Например, 2 * 3 = 6.
                        <br/>
                        4) Целочисленное деление: операция, выполняющая деление одного целого числа на другое и возвращающая только целую часть результата. Например, 7 / 3 = 2.
                        <br/>
                        5)Остаток от деления: операция, возвращающая остаток от деления одного целого числа на другое. Например, остаток от деления 7 на 3 равен 1.
                        <br/>
                        Целочисленная арифметика используется во многих областях, включая программирование, математику, физику и инженерные науки. В программировании целочисленная арифметика особенно полезна при работе с массивами, циклами и другими операциями, где десятичная точность не требуется или нежелательна.
                </p>

        </div>
    );
};

export default ArithmeticOne;