import React from 'react';

const Arithmeticthree = () => {
    return (
        <div className="container">
            <p className="desc">
                Десятичные дроби - это числа, которые представляются в десятичной системе счисления и имеют десятичную часть (дробную часть), разделенную десятичным разделителем (обычно точкой). Десятичные дроби используются для представления дробных значений, которые не являются целыми числами.
                <br/>
                Например, в числе 3.14, целая часть равна 3, а десятичная часть (дробная часть) равна 0.14. Десятичная дробь может иметь любое количество цифр после десятичного разделителя и представлять различные значения, в зависимости от количества цифр и их значений.
<br/>
                Десятичные дроби позволяют нам представлять и работать с дробными значениями, такими как денежные суммы, результаты измерений, процентные значения и другие. Они широко используются в различных областях, включая финансы, науку о данных, инженерию и программирование.
<br/>
               <br/> В программировании существуют специальные типы данных для работы с десятичными дробями, такие как числа с плавающей точкой (float) или числа с двойной точностью (double). Эти типы данных обеспечивают точность и диапазон для хранения и выполнения операций с десятичными дробями.
            </p>
        </div>
    );
};

export default Arithmeticthree;