import React from 'react';

const Arithmetictwo = () => {
    return (
        <div className="container">
            <p className="desc">
                Десятичная арифметика - это раздел математики и программирования, который занимается операциями с числами, включающими десятичную часть (дроби) и десятичные разделители. В отличие от целочисленной арифметики, десятичная арифметика учитывает десятичные разделители и допускает точность до определенного числа знаков после запятой.

                <br/>В десятичной арифметике доступны следующие операции:

                <br/>Сложение: операция, выполняющая сложение двух десятичных чисел с учетом десятичной точности. Например, 2.5 + 3.7 = 6.2.

                <br/>Вычитание: операция, выполняющая вычитание одного десятичного числа из другого с учетом десятичной точности. Например, 5.3 - 3.1 = 2.2.

                <br/>Умножение: операция, выполняющая умножение двух десятичных чисел с учетом десятичной точности. Например, 2.5 * 3.2 = 8.0.

                <br/>Деление: операция, выполняющая деление одного десятичного числа на другое с учетом десятичной точности. Например, 7.5 / 2.5 = 3.0.

                <br/>Округление: операция, которая позволяет округлить десятичное число до определенной точности. Например, округление числа 3.7 до ближайшего целого числа равно 4.

                <br/>Десятичная арифметика широко используется во многих областях, включая финансы, инженерию, науку о данных и программирование, где требуется точность до десятичных знаков. В программировании часто используются специальные типы данных, такие как числа с плавающей точкой или десятичные числа, чтобы обеспечить точность и диапазон для операций с десятичными числами.
            </p>
        </div>
    );
};

export default Arithmetictwo;