import React from 'react';

const ProbabilityFive = () => {
    return (
        <div className='container'>
            <p className="desc">
                Диаграммы и графики - это визуальные инструменты, которые помогают представить данные и информацию в более наглядной и понятной форме. Они позволяют визуализировать связи, распределения, тренды и сравнения между данными. Вот несколько распространенных типов диаграмм и графиков:
<br/>
                Столбчатые диаграммы: Используются для сравнения значений различных категорий. Они состоят из вертикальных столбцов, где высота каждого столбца представляет значение.
<br/>
                Линейные графики: Используются для отображения изменения значений по оси времени или другой непрерывной переменной. Линейные графики соединяют точки данных линиями, образуя график.
<br/>
                Круговые диаграммы: Используются для отображения доли каждой категории в целом. Круговая диаграмма представляет собой круг, разделенный на секторы, пропорциональные относительным значениям.
<br/>
                Гистограммы: Используются для показа распределения данных по различным интервалам или категориям. Гистограмма представляет собой столбчатую диаграмму, где каждый столбец представляет интервал или категорию, а высота столбца представляет количество или частоту вхождений в этот интервал.
<br/>
                Коробчатые диаграммы: Используются для отображения распределения данных и основных статистических показателей, таких как медиана, квартили и выбросы. Коробчатая диаграмма представляет собой прямоугольник, внутри которого находится отрезок (ящик), представляющий интерквартильный размах, а отметки и линии представляют выбросы и медиану.
<br/>
                Диаграммы рассеяния: Используются для отображения взаимосвязи между двумя переменными. Каждая точка на диаграмме представляет пару значений двух переменных, что позволяет выявить корреляцию или общую тенденцию.
<br/>
                Это только некоторые из множества типов диаграмм и графиков, которые можно использовать в анализе данных. Выбор определенного типа зависит от цели вашего исследов
            </p>
        </div>
    );
};

export default ProbabilityFive;