import React from 'react';

const GeometryTwo = () => {
    return (
        <div className="container">
            <p className="desc">
                Фигура - это геометрическое обозначение для описания формы или внешнего вида объекта. В математике и геометрии фигура может быть двухмерной (плоской) или трехмерной (пространственной).
<br/>
                В двухмерной геометрии примерами фигур могут быть треугольники, квадраты, прямоугольники, круги, эллипсы, многоугольники и другие. Они описываются с помощью своих сторон, углов, радиуса или других характеристик.
<br/>
                В трехмерной геометрии фигуры имеют объем и форму в трех измерениях. Примерами трехмерных фигур могут быть кубы, параллелепипеды, сферы, конусы, цилиндры, пирамиды и другие. Они описываются с помощью объема, высоты, радиуса, боковой поверхности или других характеристик.
<br/>
                Фигуры могут иметь различные свойства, такие как симметрия, периметр, площадь, объем, диагонали, углы и другие. Они могут быть классифицированы в соответствии с их формой, размерами и другими характеристиками.
<br/>
                Геометрия фигур имеет широкое применение в различных областях, включая архитектуру, дизайн, инженерию, физику, компьютерную графику и другие. Понимание фигур и их свойств является важным для анализа, измерения и моделирования объектов в реальном мире.
            </p>
        </div>
    );
};

export default GeometryTwo;