import React from 'react';

const GeometryThree = () => {
    return (
        <div className="container">
            <p className="desc">
                Прямоугольник - это четырехугольник, у которого все углы прямые (равны 90 градусам). Прямоугольник имеет две пары параллельных сторон и все его углы равны.
<br/>
                Основные характеристики прямоугольника включают:
<br/>
                Стороны: Прямоугольник имеет две пары параллельных сторон, противоположные стороны равны по длине.
<br/>
                Углы: Все углы прямоугольника равны 90 градусам.
<br/>
                Диагонали: Диагонали прямоугольника равны по длине и делят его на два равных прямоугольных треугольника.
<br/>
                Периметр: Периметр прямоугольника вычисляется как сумма длин всех его сторон: P = 2a + 2b, где a и b - длины сторон.
<br/>
                Площадь: Площадь прямоугольника вычисляется как произведение длин его сторон: A = a * b, где a и b - длины сторон.
<br/>
                Диагональная: Диагональ прямоугольника вычисляется с использованием теоремы Пифагора: d = √(a^2 + b^2), где a и b - длины сторон, а d - диагональ.
<br/>
                Прямоугольники широко применяются в геометрии и в различных областях, включая архитектуру, инженерию, строительство, дизайн, компьютерную графику и т. д. Их простая структура и свойства делают их полезными для моделирования и расчетов.
            </p>
        </div>
    );
};

export default GeometryThree;