import React from 'react';

const GeometrySix = () => {
    return (
        <div className="container">
            <p className="desc">
                Формулы для вычисления объема некоторых геометрических фигур:
<br/>
                Объем прямоугольного параллелепипеда:
                <br/>Объем прямоугольного параллелепипеда можно вычислить, зная длину (a), ширину (b) и высоту (h) параллелепипеда: V = a * b * h.
<br/>
                Объем цилиндра:
                <br/>Объем цилиндра можно вычислить, зная радиус основания (r) и высоту (h) цилиндра:
                <br/>V = π * r^2 * h, где π (пи) - математическая константа, приближенно равная 3.14159.

                <br/>Объем - это мера трехмерного пространства, заполненного геометрическим объектом. Формулы для вычисления объема прямоугольного параллелепипеда и цилиндра позволяют определить, сколько пространства занимают данные фигуры.

                <br/>Эти формулы широко используются в математике, геометрии, физике, инженерии и других научных областях для расчетов объемов и решения различных задач.
            </p>
        </div>
    );
};

export default GeometrySix;