import React from 'react';

const GeometryFour = () => {
    return (
        <div className="container">
            <p className="desc">
                Круг - это геометрическая фигура, состоящая из всех точек на плоскости, которые находятся на одинаковом расстоянии от центра. Расстояние от центра круга до любой точки на его окружности называется радиусом круга (обозначается как "r"). Диаметр круга (обозначается как "d") - это двукратное значение радиуса и равен отрезку, соединяющему две точки на окружности и проходящему через центр круга.
<br/>
                Основные характеристики круга включают:
<br/>
                Центр: Центр круга - это точка, которая находится на одинаковом расстоянии от всех точек на окружности.
<br/>
                Окружность: Окружность - это граница круга, представляющая собой замкнутую кривую линию, состоящую из всех точек, находящихся на одинаковом расстоянии от центра.
<br/>
                Радиус: Радиус круга - это расстояние от центра круга до любой точки на его окружности. Радиус обозначается как "r".
<br/>
                Диаметр: Диаметр круга - это двукратное значение радиуса и равен отрезку, соединяющему две точки на окружности и проходящему через центр круга. Диаметр обозначается как "d".
<br/>
                Площадь: Площадь круга вычисляется по формуле: A = πr^2, где π (пи) - это математическая константа, приближенно равная 3.14159.
<br/>
                Длина окружности: Длина окружности вычисляется по формуле: C = 2πr или C = πd, где С - длина окружности.
<br/>
                Круги широко применяются в геометрии, физике, инженерии и других научных областях. Они имеют множество интересных свойств и приложений, включая моделирование движения, анализ статистических данных, создание графиков и многое другое.
            </p>
        </div>
    );
};

export default GeometryFour;