import React from 'react';

const GeometryOne = () => {
    return (
        <div className="container">
            <p className="desc">
                Треугольник - это геометрическая фигура, состоящая из трех сторон и трех углов. Он является одной из основных фигур в геометрии и имеет множество свойств и характеристик.
<br/>
                Основные типы треугольников включают:
<br/>
                Прямоугольный треугольник: Треугольник, у которого один из углов является прямым (равным 90 градусам). Сторона, противолежащая прямому углу, называется гипотенузой, а две другие стороны - катетами.
<br/>
                Равносторонний треугольник: Треугольник, у которого все три стороны равны. Все углы в равностороннем треугольнике также равны 60 градусам.
<br/>
                Равнобедренный треугольник: Треугольник, у которого две стороны равны. Углы, противолежащие равным сторонам, также равны.
<br/>
                Остроугольный треугольник: Треугольник, у которого все три угла острые (меньше 90 градусов).
<br/>
                Тупоугольный треугольник: Треугольник, у которого один из углов тупой (больше 90 градусов).
<br/>
                Неравносторонний треугольник: Треугольник, у которого все три стороны и углы различны.
<br/>
                Треугольники могут быть классифицированы и на основе своих сторон и углов, и в зависимости от этого могут иметь различные свойства и формулы, связанные с их площадью, периметром, высотами, медианами и другими характеристиками.
<br/>
                Кроме того, существуют различные теоремы и правила, такие как теорема Пифагора, теорема синусов и теорема косинусов, которые могут использоваться для решения задач и нахождения неизвестных сторон и углов в треугольниках.
            </p>
        </div>
    );
};

export default GeometryOne;