import React from 'react';

const TrigonometricTwo = () => {
    return (
        <div className="container">
            <p className="desc">
                Косинус (обозначается как cos) - это тригонометрическая функция, которая определяется отношением прилежащей стороны треугольника к его гипотенузе в прямоугольном треугольнике.
<br/>
                В единичном окружении (окружности радиусом 1), косинус угла определяется как абсцисса (горизонтальная координата) точки на окружности, полученной пересечением угла и единичной окружности.
<br/>
                Значения косинуса также находятся в диапазоне от -1 до 1. Основные свойства косинуса включают:
<br/>
                Ограниченность: Косинус принимает значения от -1 до 1.
<br/>
                Периодичность: Косинус является периодической функцией с периодом 2π (или 360 градусов). Значения косинуса повторяются через каждые 2π или 360 градусов.
<br/>
                Четность: Косинус является четной функцией, то есть cos(-x) = cos(x). Это означает, что косинус угла и его отрицательного значения равны.
<br/>
                Тригонометрические тождества: Косинус связан с другими тригонометрическими функциями через тригонометрические тождества, такие как тождество Пифагора и формулы синуса и косинуса.
<br/>
                Косинус также широко применяется в математике, физике, инженерии и других науках. Он используется для решения задач, связанных с колебаниями, периодическими функциями, гармоническими волнами, преобразованиями Фурье и другими областями, где важно анализировать периодические явления и их свойства.
            </p>
        </div>
    );
};

export default TrigonometricTwo;